<?php

/** Request *****************************************************************
 * 
 * 功能描述：根据公司id批量获取公司别名
 * 
 * 逻辑步骤：
 * 1、验证ids
 * 2、获取公司别名   条件是  corporation_id   is_deleted
 * *************************************************************************
 */
require_once './public.php';
$param=array(
    "hearder"=>head(),
    "request"=>array(
        "w"=>"gsystem_basic_offline",
        "c"=>"Logic_corporation_alias",
        "m"=>"get_multi",
        "p"=>array(
            "ids"=>[1869,1695,1959]            //简历id               
        )
    )
);
echo client($param);
 
//测试方法  1、先根据简历id获取简历详情，详情如下：
//{
//    "response": {
//        "err_no": 0,
//        "err_msg": "",
//        "results": {
//            "1695": [                               //key 为公司id
//                "武汉天罡科技发展有限责任公司"      //公司别名
//            ],
//            "1869": [                               //当有多个公司别名的时候，这里的排序是根据库中的sort进行排序的
//                "佑一良品",   
//                "uiyi"
//            ],
//            "1959": [
//                "北京圣特尔科技发展有限公司",
//                "圣特尔",
//                "圣特尔科技"
//            ]
//        }
//    }
//}

//错误提示：
//100001   ids 不能为空！